Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Note that the examples and demos explicitly need to be enabled in ``lv_conf.h`` if you need them.
it_it: Nota: gli esempi e le demo devono essere esplicitamente abilitati in ``lv_conf.h`` se sono necessarie.

source: Note that the last element must be either ``NULL`` or an empty string (``""``)!
it_it: Si noti che l'ultimo elemento deve essere ``NULL`` o una stringa vuota (``""``)!

source: Note that the nested list above is preceded
it_it: Si noti che l'elenco nidificato sopra riportato è preceduto

source: Note that the real coordinates of image Widgets do not change with a transformation.
it_it: Si noti che le coordinate reali dei Widget Image non cambiano con una trasformazione.

source: Note that the state of :cpp:enumerator:`LV_KEY_ENTER` is translated to :cpp:enumerator:`LV_EVENT_PRESSED`, :cpp:enumerator:`LV_EVENT_PRESSING` and :cpp:enumerator:`LV_EVENT_RELEASED` etc.
it_it: Si noti che lo stato di :cpp:enumerator:`LV_KEY_ENTER` viene tradotto in :cpp:enumerator:`LV_EVENT_PRESSED`, :cpp:enumerator:`LV_EVENT_PRESSING` e :cpp:enumerator:`LV_EVENT_RELEASED` ecc.

source: Note that these indices are "fluid", meaning if "mybtn_2" above is deleted, the button previously known as "mybtn_3" will thereafter be known as "mybtn_2", since the indices are resolved *when names are being found by name*, not when they are set.
it_it: Si noti che questi indici sono "fluidi", ovvero se si elimina "mybtn_2" sopra, il pulsante precedentemente noto come "mybtn_3" sarà in seguito noto come "mybtn_2", poiché gli indici vengono risolti *quando i nomi vengono trovati per nome*, non quando vengono impostati.

source: Note that this function returns the stored pointer as a ``lv_obj_t *`` type, as opposed to the ``void *`` type returned by :cpp:expr:`lv_observer_get_target_obj(observer)`.
it_it: Si noti che questa funzione restituisce il puntatore memorizzato come tipo ``lv_obj_t *``, a differenza del tipo ``void *`` restituito da :cpp:expr:`lv_observer_get_target_obj(observer)`.

source: Note that this has a visible effect only if:
it_it: Si noti che questo ha un effetto visibile solo se:

source: Note that this is a one-way binding (Subject ===> Widget).
it_it: Si noti che questo è un binding unidirezionale (Subject ===> Widget).

source: Note that this is a one-way binding (Subject ==> Widget) as the Scale Section's boundaries are not interactive.
it_it: Si noti che si tratta di un binding unidirezionale (Subject ==> Widget) poiché i limiti della Sezione "Scale" non sono interattivi.

source: Note that this is a one-way binding (Subject ==> Widget) so when the subject changes the Bar will be updated too.
it_it: Si noti che si tratta di un binding unidirezionale (Subject ==> Widget), quindi quando il Subject cambia, anche la Bar verrà aggiornata.

source: Note that this is a one-way binding (Subject ==> Widget) so when the subject changes, the Image will be updated too.
it_it: Si noti che si tratta di un binding unidirezionale (Subject ==> Widget), quindi quando il subject cambia, anche l'Image verrà aggiornata.

source: Note that this is a two-way binding (Subject <===> Widget) so an end user's direct interaction with the Drop-Down Widget updates the Subject's value and vice versa.
it_it: Si noti che si tratta di un'associazione bidirezionale (Soggetto <===> Widget), quindi l'interazione diretta di un utente finale con il Widget Drop-Down aggiorna il valore del Subject e viceversa.

source: Note that this is a two-way binding (Subject <===> Widget) so an end user's direct interaction with the Roller Widget updates the Subject's value and vice versa.
it_it: Si noti che si tratta di un binding bidirezionale (Subject <===> Widget), quindi l'interazione diretta di un utente finale col Widget Roller aggiorna il valore del Subject e viceversa.

source: Note that this is a two-way binding (Subject <===> Widget) so direct (or programmatic) interaction with the Widget that causes its :cpp:enumerator:`LV_STATE_CHECKED` state to be SET or CLEARED also causes the Subject's value to be set to ``1`` or ``0`` respectively.
it_it: Si noti che si tratta di un binding bidirezionale (Subject <===> Widget), quindi l'interazione diretta (o programmatica) con il Widget che determina il suo stato :cpp:enumerator:`LV_STATE_CHECKED` su SET o CLEARED determina anche l'impostazione del valore del Subject rispettivamente su ``1`` o ``0``.

source: Note that this is a two-way binding (Subject <===> Widget), so an end user's direct interaction with the Arc Widget updates the Subject's value and vice versa.
it_it: Si noti che si tratta di un binding bidirezionale (Subject <===> Widget), quindi l'interazione diretta di un utente finale con il Widget Arc aggiorna il valore del Subject e viceversa.

source: Note that this is a two-way binding (Subject <===> Widget), so an end user's direct interaction with the Slider Widget updates the Subject's value and vice versa.
it_it: Si noti che si tratta di un binding bidirezionale (Subject <===> Widget), quindi l'interazione diretta di un utente finale con il Widget Slider aggiorna il valore del Subject e viceversa.

source: Note that this is a two-way binding (Subject <===> Widget), so an end user's direct interaction with the Spinbox Widget updates the Subject's value and vice versa.
it_it: Si noti che si tratta di un'associazione bidirezionale (Subject <===> Widget), quindi l'interazione diretta di un utente finale con il Widget Spinbox aggiorna il valore del Subject e viceversa.

source: Note that this is not about swapping the Red and Blue channel but converting
it_it: Si noti che non si tratta di scambiare i canali Rosso e Blu, ma di convertire

source: Note that this pointer may be different than :cpp:expr:`widget->class_p` which is the class of the Widget currently being created.
it_it: Si noti che questo puntatore potrebbe essere diverso da :cpp:expr:`widget->class_p`, che è la classe del Widget attualmente in fase di creazione.

source: Note that to support binary name searches, these arrays are generated so that they are guaranteed to be in alphabetical order.
it_it: Si noti che per supportare le ricerche di nomi binari, questi array vengono generati in modo da garantire che siano in ordine alfabetico.

source: Note that touchscreens are treated as (absolute) pointer devices by the libinput driver and require ``LV_INDEV_TYPE_POINTER``.
it_it: Si noti che i touchscreen vengono trattati come dispositivi di puntamento (assoluti) dal driver libinput e richiedono ``LV_INDEV_TYPE_POINTER``.

source: Note that visually the spaces are not equal since all the items have equal space on both sides.
it_it: Si noti che visivamente gli spazi non sono uguali poiché tutti gli elementi hanno uguale spazio su entrambi i lati.

source: Note that visually the spaces aren't equal, since all the items have equal space on both sides.
it_it: Si noti che visivamente gli spazi non sono uguali, poiché tutti gli elementi hanno lo stesso spazio su entrambi i lati.

source: Note that which display is targeted is passed to the function, so you can use the same function for multiple displays, or use different functions for multiple displays.
it_it: Si noti che il display di destinazione viene passato alla funzione, quindi si può utilizzare la stessa funzione per più display o utilizzare funzioni diverse per più display.

source: Note that you need to choose a board powerful enough to run LVGL and your GUI.
it_it: Si noti che è necessario scegliere una scheda sufficientemente potente per eseguire LVGL e la propria GUI.

source: Note that you need to delete any Widgets that used the font first, and then delete the font to avoid accessing wild pointers.
it_it: Si noti che è necessario eliminare prima tutti i Widget che utilizzavano il font, poi eliminare il font per evitare di accedere a puntatori indesiderati.

source: Note that, Rlottie uses the standard STDIO C file API, so you can use the path "normally" and no LVGL specific driver letter is required.
it_it: Nota: Rlottie utilizza l'API standard per file C STDIO, quindi è possibile utilizzare il path "normalmente" e non è richiesta alcuna lettera driver specifica per LVGL.

source: Note that, a :ref:`file_system` driver needs to registered to open images from files.
it_it: Si noti che per aprire le immagini da file è necessario registrare un driver :ref:`file_system`.

source: Note that, a file system driver needs to be registered to open images from files.
it_it: Si noti che è necessario registrare un driver del file system per aprire le immagini da file.

source: Note that, as usual, the state of :cpp:enumerator:`LV_KEY_ENTER` is translated to ``LV_EVENT_PRESSED/PRESSING/RELEASED`` etc.
it_it: Si noti che, come di consueto, lo stato di :cpp:enumerator:`LV_KEY_ENTER` viene tradotto in ``LV_EVENT_PRESSED/PRESSING/RELEASED`` ecc.

source: Note that, the ``base_dir`` style property is inherited.
it_it: Si noti che la proprietà di stile ``base_dir`` viene ereditata.

source: Note that, there is no dedicated INO file for every example.
it_it: Notare che non esiste un file INO dedicato per ogni esempio.

source: Note this is different from :ref:`observer_widget_binding`.
it_it: Si noti che questo è diverso dal :ref:`observer_widget_binding`.

source: Note, only following color formats are supported at this time:
it_it: Nota: al momento sono supportati solo i seguenti formati colore:

source: Note: back-quotes are not needed if there are no spaces in the name.
it_it: Nota: le virgolette inverse non sono necessarie se il nome non contiene spazi.

source: Note: the section headings in these pages use a different convention than the one presented below.
it_it: Nota: le intestazioni di sezione in queste pagine utilizzano una convenzione diversa da quella presentata di seguito.

source: Note: this does not preserve its state.
it_it: Nota: questo non ne preserva lo stato.

source: Note: Rendering large shadows may be slow or memory-intensive.
it_it: Nota: Il rendering di ombre di grandi dimensioni può essere lento o richiedere molta memoria.

source: Note: Since layout and size may depend on the parent, :cpp:func:`lv_obj_update_layout` recalculates coordinates for **all** widgets on the screen of the given object.
it_it: Nota: Poiché il layout e le dimensioni possono dipendere dall'oggetto padre, :cpp:func:`lv_obj_update_layout` ricalcola le coordinate per **tutti** i widget sullo schermo dell'oggetto specificato.

source: Note: The Codespaces setup also uses Emscripten for browser rendering.
it_it: Nota: La configurazione di Codespaces utilizza anche Emscripten per il rendering del browser.

source: Note: The ``lv_obj-`` prefix can be omitted.
it_it: Nota: Il prefisso ``lv_obj-`` può essere omesso.

source: Note: The layer must have a color format with an alpha channel, typically :cpp:expr:`LV_COLOR_FORMAT_ARGB8888`.
it_it: Nota: Il layer deve avere un formato colore con un canale alfa, in genere :cpp:expr:`LV_COLOR_FORMAT_ARGB8888`.

source: Note: World position registration incurs additional computational cost due to matrix transformations.
it_it: Nota: La registrazione della posizione globale comporta un costo computazionale aggiuntivo a causa delle trasformazioni della matrice.

source: Note: if using a Docker container, it's better to edit the JSON file in the project directory at ``.vscode/settings.json``.
it_it: Nota: se si utilizza un container Docker, è meglio modificare il file JSON nella directory del progetto in ``.vscode/settings.json``.

source: Note: these callbacks are **not** automatically removed when a subject is de-initialized.
it_it: Nota: queste callback **non** vengono rimosse automaticamente quando un soggetto viene deinizializzato.

source: Note: this affects the number of points processed when an external value array is assigned to a series, so you also need to be sure any external array so provided contains at least ``point_num`` elements.
it_it: Nota: questo influisce sul numero di punti elaborati quando un array di valori esterni viene assegnato a una serie; quindi è necessario assicurarsi che qualsiasi array esterno fornito contenga almeno ``point_num`` elementi.

source: Notes
it_it: Note

source: Notes for the UI Editor
it_it: Note per l'Editor dell'Interfaccia Utente

source: Notes on Using MUTEXES
it_it: Note sull'Utilizzo dei MUTEX

source: Nothing more is required for DMA2D to start working immediately, but you may want to make some other considerations.
it_it: Non è richiesto altro per far funzionare DMA2D immediatamente, ma potrebbe essere opportuno fare alcune considerazioni.

source: Nothing more, no wasting of time.
it_it: Niente di più, nessuna perdita di tempo.

source: Notifications are performed by calling the callback function provided when subscribing to the Subject.
it_it: Le notifiche vengono eseguite chiamando la funzione di callback fornita al momento dell'iscrizione al Subject.

source: Now add the recipe to the project.
it_it: Si aggiunge la ricetta al progetto.

source: Now build the SDK and install it
it_it: Ora compilare l'SDK e installarlo

source: Now build the image
it_it: Ora compilare l'immagine.

source: Now edit the Dockerfile.
it_it: Ora si modifica il Dockerfile.

source: Now let's create a workspace to save our files
it_it: Ora creiamo un'area di lavoro in cui salvare i nostri file.

source: Now that the source files are included in your project, follow the instructions to :ref:`add LVGL to your project <adding_lvgl_to_your_project>` and to create the ``lv_conf.h`` file and initialize the display.
it_it: Ora che i file sorgente sono inclusi nel progetto, seguire le istruzioni per :ref:`aggiungere LVGL al progetto <adding_lvgl_to_your_project>`, per creare il file ``lv_conf.h`` e inizializzare il display.

source: Now that we have satisfied all the prerequisites lets download a stable release of Buildroot.
it_it: Ora che abbiamo soddisfatto tutti i prerequisiti, scarichiamo una versione stabile di Buildroot.

source: Now to use the SDK environment and cross-compile an application:
it_it: Ora, per utilizzare l'ambiente SDK e cross-compilare un'applicazione:

source: Now use ``make`` command to apply the rootfs overlay and confirm the sysroot was updated as expected.
it_it: Ora utilizzare il comando ``make`` per applicare l'overlay rootfs e verificare che la sysroot sia stata aggiornata come previsto.

source: Now you can ``git clone`` the latest LVGL into the NuttX apps tree.
it_it: Ora si può usare ``git clone`` per l'ultima versione di LVGL nell'albero delle app di NuttX.

source: Now you can click the hammer icon next to the play icon to compile the project.
it_it: Ora si può cliccare sull'icona del martello accanto all'icona di "play" per compilare il progetto.

source: Now you should have a folder named ``build`` next to ``sources``.
it_it: Ora si dovrebbe avere una cartella chiamata ``build`` accanto a ``sources``.

source: Now, Rlottie is available as a component in the IDF, but it requires some additional changes and a CMakeLists file to tell the IDF how to compile.
it_it: Ora, Rlottie è disponibile come componente nell'IDF, ma richiede alcune modifiche aggiuntive e un file CMakeLists per indicare all'IDF come compilare.

source: Number of bytes between the beginning of one row of pixels and the beginning of the next row
it_it: Numero di byte tra l'inizio di una riga di pixel e l'inizio della riga successiva

source: Number of characters to render (0 means render until `\\0`).
it_it: Numero di caratteri da visualizzare (0 indica il rendering fino a `\\0`).

source: Number of points
it_it: Numero di punti

source: NuttX + LVGL could be used for
it_it: NuttX + LVGL potrebbero essere utilizzati per

source: NuttX Driver Support
it_it: Supporto Driver NuttX

source: NuttX Simulator
it_it: Simulatore NuttX

source: NuttX mailing list: `Apache NuttX Mailing List <http://nuttx.incubator.apache.org/community/>`__
it_it: Mailing list NuttX: `Apache NuttX Mailing List <http://nuttx.incubator.apache.org/community/>`__

source: NuttX tries to be POSIX compliant where possible, meaning it supports pthreads (POSIX threads).
it_it: NuttX cerca di essere compatibile con POSIX ove possibile, il che significa che supporta i pthread (thread POSIX).

source: OPA_80`` follow logically
it_it: OPA_80`` seguono logicamente

source: OR-ed values are also possible.
it_it: Sono possibili anche valori in OR.

source: OR-ed values can be used as well, e.g. `LV_BORDER_SIDE_TOP | LV_BORDER_SIDE_LEFT`.
it_it: È possibile utilizzare anche valori OR, ad esempio `LV_BORDER_SIDE_TOP | LV_BORDER_SIDE_LEFT`.

source: OR-ed values can be used as well.
it_it: È possibile utilizzare anche valori con OR.

source: OS Support
it_it: Supporto per OS

source: OS or no OS
it_it: OS o non OS

source: Observers
it_it: Observer

source: Observers are then added to Subject Groups (e.g. ``subject_all``) in the usual way.
it_it: Gli Observer vengono poi aggiunti ai Gruppi di Subject (ad esempio ``subject_all``) nel modo consueto.

source: Obtaining LVGL
it_it: Ottenere LVGL

source: Of course any other fonts can be used, just make sure that they define the symbols you need.
it_it: Naturalmente è possibile utilizzare qualsiasi altro font, assicurandosi solo che definisca i simboli necessari.

source: Of course, caching images is resource intensive as it uses more RAM to store the decoded image.
it_it: Naturalmente, la memorizzazione nella cache delle immagini richiede molte risorse, poiché utilizza più RAM per memorizzare l'immagine decodificata.

source: Of course, the decompression logic must be part of your project by enabling appropriate ``LV_USE_RLE``, ``LV_USE_LZ4_INTERNAL``, and/or ``LV_USE_LZ4_EXTERNAL`` macros in your ``lv_conf.h`` file.
it_it: Naturalmente, la logica di decompressione deve essere parte integrante del progetto, abilitando le macro appropriate ``LV_USE_RLE``, ``LV_USE_LZ4_INTERNAL`` e/o ``LV_USE_LZ4_EXTERNAL`` nel file ``lv_conf.h``.

source: Offline Converter
it_it: Convertitore Offline

source: Offline converter in ``./scripts/LVGLImage.py``.
it_it: Convertitore offline in ``./scripts/LVGLImage.py``.

source: Offload rendering to external EVE chips via SPI, freeing up your MCU's CPU for other tasks.
it_it: Scaricare il rendering su chip EVE esterni tramite SPI, liberando la CPU dell'MCU per altre attività.

source: Offset is applied to shift the tiling.
it_it: L'offset viene applicato per spostare l'affiancamento.

source: On Debian/Ubuntu-based systems:
it_it: Su sistemi basati su Debian/Ubuntu:

source: On EK-RA8D1 boards, the ``SW1`` DIP switch 7 (in the middle of the board) should be ON, all others are OFF.
it_it: Sulle schede EK-RA8D1, il DIP switch 7 ``SW1`` (al centro della board) deve essere impostato su ON, tutti gli altri su OFF.

source: On Fedora
it_it: Su Fedora

source: On LINE charts, if the number of points is greater than the pixels horizontally, the Chart will draw only vertical lines to make the drawing of large amount of data effective.
it_it: Nei grafici LINE, se il numero di punti è maggiore dei pixel in orizzontale, il grafico disegnerà solo linee verticali per rendere efficace la visualizzazione di grandi quantità di dati.

source: On Linux and Windows, it will ask the user to browse for the install location of the Editor.
it_it: Su Linux e Windows, chiederà all'utente di cercare il path di installazione dell'Editor.

source: On Linux, extracting can be done by running the following
it_it: Su Linux, l'estrazione può essere eseguita eseguendo quanto segue:

source: On Linux, they will be something like ``/dev/ttyACM0`` and ``/dev/ttyACM1``.
it_it: Su Linux, saranno simili a ``/dev/ttyACM0`` e ``/dev/ttyACM1``.

source: On Linux:
it_it: Su Linux

source: On MPU platforms, the acceleration can be done (hardware independent) by NXP G2D library.
it_it: Sulle piattaforme MPU, l'accelerazione può essere eseguita (indipendentemente dall'hardware) dalla libreria NXP G2D.

source: On Ubuntu
it_it: Su Ubuntu

source: On Ubuntu Systems, just type
it_it: Sui Sistemi Ubuntu, digitare semplicemente

source: On embedded systems you need to take care of integrating Rlottie to the given build system.
it_it: Sui sistemi embedded, ci si deve occupare di integrare Rlottie nel sistema di Build specificato.

source: On modern computing hardware meant to be used with larger display panels, there are sometimes options for different ways drawing can be accomplished.
it_it: Sull'hardware di elaborazione moderno, progettato per essere utilizzato con schermi di grandi dimensioni, a volte sono disponibili diverse opzioni per eseguire il disegno.

source: On some cases for pure filling on integer multiples of the display size it is possible to observe up 9x of speed increase when the PPA is enabled.
it_it: In alcuni casi, per il riempimento puro su multipli interi della dimensione del display, è possibile osservare un aumento della velocità fino a 9 volte quando il PPA è abilitato.

source: On such systems, libjpeg-turbo is generally 2-6x as fast as libjpeg, all else being equal.
it_it: Su tali sistemi, libjpeg-turbo è generalmente da 2 a 6 volte più veloce di libjpeg, a parità di altre condizioni.

source: On the display, all 4 channels are shown below each other.
it_it: Sul display, tutti e 4 i canali sono visualizzati uno sotto l'altro.

source: On the opening screen, example and tutorial projects are available that can be opened and tested right in the browser.
it_it: Nella schermata iniziale, sono disponibili progetti di esempio e tutorial che possono essere aperti e testati direttamente nel browser.

source: On the other hand, all C modules have sophisticated smart hints, even hinting at the types of your arguments .
it_it: D'altra parte, tutti i moduli C dispongono di suggerimenti intelligenti sofisticati, persino per i tipi degli argomenti.

source: On the other hand, you can leave valuable space for more material or larger buffer areas.
it_it: D'altra parte, è possibile lasciare spazio prezioso per più materiale o aree di buffer più grandi.

source: On the pages above users would be able to check the respective getting started on these platforms where ESP32, and other chips are abstracted by the framework.
it_it: Nelle pagine sopra riportate, gli utenti potranno consultare le rispettive istruzioni per iniziare su queste piattaforme, dove ESP32 e altri chip sono astratti dal framework.

source: On these pages you can learn more about :ref:`XML <xml_overview>` and the :ref:`Editor <editor_overview>`.
it_it: In queste pagine se ne può saperne di più su :ref:`XML <xml_overview>` e su :ref:`Editor <editor_overview>`.

source: On top of that standard command set each LCD controller chip has a number of vendor-specific commands to configure voltage generator levels, timings, or gamma curves.
it_it: Oltre a questo set di comandi standard, ogni chip controller LCD dispone di una serie di comandi specifici del fornitore per configurare i livelli del generatore di tensione, le temporizzazioni o le curve gamma.

source: Once Python is installed
it_it: Una volta installato Python

source: Once a *live running* Animation has been started, it runs until it has completed, or until it is deleted (see below), whichever comes first.
it_it: Una volta avviata un'animazione *in esecuzione*, questa prosegue fino al suo completamento o fino a quando non viene eliminata (vedere di seguito), a seconda di quale evento si verifica per primo.

source: Once a Component is created (e.g., ``my_button``), it can be registered by calling either:
it_it: Una volta creato un Componente (ad esempio, ``my_button``), può essere registrato chiamando:
